Revit 2027 API
IFCImportAction Enumeration
 The action of the IFC import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCImportAction
Public Enumeration IFCImportAction
public enum class IFCImportAction
type IFCImportAction
Members
Member name | Value | Description
Link | 1 |  Link into an existing project file.
Open | 0 |  Open a new project file.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace